; domain
(define (domain lec-winter-split)
    (:requirements :strips :typing :equality :negative-preconditions)
    
    (:types 
        match team referee server slot - object
    )
    
    (:constants 
        home away - slot 
    )

    (:predicates
        ;; Topología del torneo
        (connected ?m1 - match ?m2 - match ?s - slot)
        (participant ?t - team ?m - match ?s - slot)
        
        ;; Estado del Partido
        (scheduled ?m - match)          ;; Partido en lobby/champ select
        (played ?m - match)             ;; La partida terminó (nexus explota)
        (result-reported ?m - match)    ;; El arbitro firmó el acta
        (verified ?m - match)           ;; La liga validó el resultado final
        (winner-determined ?m - match)  ;; Hay un ganador oficial
        (winner ?m - match ?t - team)
        
        ;; Gestión de Conflictos e Incidencias
        (has-conflict ?m - match)       ;; PREDICADO ESTÁTICO: Indica que este match "está gafado" y fallará
        (protest-active ?m - match)     ;; Hay una pausa/protesta en curso
        (protest-handled ?m - match)    ;; La protesta se resolvió (se mantiene el resultado)
        
        ;; Recursos
        (ref-available ?r - referee)
        (server-available ?s - server)
        (referee-assigned ?r - referee ?m - match)
    )

    ;; --- FASE 1: PREPARACIÓN ---

    (:action start-champ-select
        :parameters (?m - match ?s - server ?t1 - team ?t2 - team)
        :precondition (and 
            (participant ?t1 ?m home)
            (participant ?t2 ?m away)
            (not (scheduled ?m))
            (not (winner-determined ?m))
            (server-available ?s)
        )
        :effect (and 
            (scheduled ?m)
            (not (server-available ?s)) ;; Ocupamos servidor
        )
    )

    ;; --- FASE 2: EJECUCIÓN (JUGAR) ---

    ;; Opción A: Partida Limpia (Solo si NO hay conflicto predefinido)
    (:action play-clean-game
        :parameters (?m - match ?s - server ?r - referee)
        :precondition (and 
            (scheduled ?m)
            (not (played ?m))
            (ref-available ?r)
            (not (has-conflict ?m)) ;; Condición clave: Solo si no está "gafado"
        )
        :effect (and 
            (played ?m)
            (server-available ?s)      ;; Liberamos server al acabar
            (not (ref-available ?r))   ;; Ocupamos árbitro para el acta
            (referee-assigned ?r ?m)
        )
    )

    ;; Opción B: Partida con Bug (Obligatoria si hay conflicto predefinido)
    (:action play-with-technical-issue
        :parameters (?m - match ?s - server ?r - referee)
        :precondition (and 
            (scheduled ?m)
            (not (played ?m))
            (ref-available ?r)
            (has-conflict ?m)       ;; Condición clave: El planificador DEBE elegir esta
        )
        :effect (and 
            (played ?m)
            (protest-active ?m)     ;; Se activa la incidencia
            (server-available ?s)   ;; Liberamos server
            (not (ref-available ?r))
            (referee-assigned ?r ?m)
        )
    )

    ;; --- FASE 3: RESOLUCIÓN DE INCIDENCIAS ---

    ;; Resolución 1: Ruling Confirm (El bug no afecta, seguimos)
    (:action adjudicate-ruling-confirm
        :parameters (?m - match ?r - referee)
        :precondition (and 
            (protest-active ?m)
            (referee-assigned ?r ?m)
        )
        :effect (and 
            (not (protest-active ?m))
            (protest-handled ?m)
        )
    )

    ;; Resolución 2: Chronobreak/Replay (Borramos lo jugado)
    (:action adjudicate-chronobreak-replay
        :parameters (?m - match ?r - referee)
        :precondition (and 
            (protest-active ?m)
            (referee-assigned ?r ?m)
        )
        :effect (and 
            (not (protest-active ?m))
            (not (played ?m))           ;; OJO: Reseteamos estado
            (not (has-conflict ?m))     ;; ASUNCIÓN: El replay arregla el bug (evita bucles infinitos)
            (not (referee-assigned ?r ?m))
            (ref-available ?r)          ;; Liberamos al árbitro para que vuelva a empezar
            ;; El partido sigue (scheduled ?m), así que se puede volver a jugar
        )
    )

    ;; --- FASE 4: ACTA Y VERIFICACIÓN ---

    ;; El árbitro firma el acta
    (:action sign-match-sheet
        :parameters (?m - match ?t - team ?r - referee)
        :precondition (and 
            (played ?m)
            (participant ?t ?m home) ;; Simplificación: Asumimos que gana HOME (para que el planner elija)
            (not (result-reported ?m))
            (not (protest-active ?m))
            (referee-assigned ?r ?m)
        )
        :effect (and 
            (result-reported ?m)
            (winner ?m ?t)
            (not (referee-assigned ?r ?m))
            (ref-available ?r) ;; Liberamos al árbitro
        )
    )

    ;; La liga verifica el resultado (Burocracia final)
    (:action verify-result
        :parameters (?m - match)
        :precondition (and 
            (result-reported ?m)
            (not (verified ?m))
        )
        :effect (and 
            (verified ?m)
            (winner-determined ?m)
        )
    )

    ;; --- OPCIÓN ESPECIAL: NO-SHOW (Sanción) ---
    (:action declare-noshow
        :parameters (?m - match ?t - team)
        :precondition (and 
            (scheduled ?m)
            (not (played ?m))
            (participant ?t ?m home) ;; O away, el planner decide quién gana por incomparecencia
        )
        :effect (and 
            (played ?m)
            (result-reported ?m)
            (winner ?m ?t)
            (verified ?m)
            (winner-determined ?m)
            ;; Si usamos esta acción, asumimos que liberamos recursos implícitamente
        )
    )

    ;; --- FASE 5: AVANCE DE BRACKET ---

    (:action promote-to-next-round
        :parameters (?m_src - match ?m_dst - match ?t - team ?s - slot)
        :precondition (and 
            (winner-determined ?m_src)
            (winner ?m_src ?t)
            (connected ?m_src ?m_dst ?s)
        )
        :effect (and 
            (participant ?t ?m_dst ?s)
        )
    )
)

; problem
(define (problem lec-32-R8-S32-P40)
    (:domain lec-winter-split)
    (:objects
        team-1 team-2 team-3 team-4 team-5 team-6 team-7 team-8 team-9 team-10 team-11 team-12 team-13 team-14 team-15 team-16 team-17 team-18 team-19 team-20 team-21 team-22 team-23 team-24 team-25 team-26 team-27 team-28 team-29 team-30 team-31 team-32 - team
        m1 m2 m3 m4 m5 m6 m7 m8 m9 m10 m11 m12 m13 m14 m15 m16 m17 m18 m19 m20 m21 m22 m23 m24 m25 m26 m27 m28 m29 m30 m31 - match
        ref-1 ref-2 ref-3 ref-4 ref-5 ref-6 ref-7 ref-8 - referee
        server-1 server-2 server-3 server-4 server-5 server-6 server-7 server-8 server-9 server-10 server-11 server-12 server-13 server-14 server-15 server-16 server-17 server-18 server-19 server-20 server-21 server-22 server-23 server-24 server-25 server-26 server-27 server-28 server-29 server-30 server-31 server-32 - server
    )
    (:init
        (ref-available ref-1)
        (ref-available ref-2)
        (ref-available ref-3)
        (ref-available ref-4)
        (ref-available ref-5)
        (ref-available ref-6)
        (ref-available ref-7)
        (ref-available ref-8)
        (server-available server-1)
        (server-available server-2)
        (server-available server-3)
        (server-available server-4)
        (server-available server-5)
        (server-available server-6)
        (server-available server-7)
        (server-available server-8)
        (server-available server-9)
        (server-available server-10)
        (server-available server-11)
        (server-available server-12)
        (server-available server-13)
        (server-available server-14)
        (server-available server-15)
        (server-available server-16)
        (server-available server-17)
        (server-available server-18)
        (server-available server-19)
        (server-available server-20)
        (server-available server-21)
        (server-available server-22)
        (server-available server-23)
        (server-available server-24)
        (server-available server-25)
        (server-available server-26)
        (server-available server-27)
        (server-available server-28)
        (server-available server-29)
        (server-available server-30)
        (server-available server-31)
        (server-available server-32)
        (participant team-1 m1 home)
        (participant team-2 m1 away)
        (participant team-3 m2 home)
        (participant team-4 m2 away)
        (participant team-5 m3 home)
        (participant team-6 m3 away)
        (participant team-7 m4 home)
        (participant team-8 m4 away)
        (participant team-9 m5 home)
        (participant team-10 m5 away)
        (participant team-11 m6 home)
        (participant team-12 m6 away)
        (participant team-13 m7 home)
        (participant team-14 m7 away)
        (participant team-15 m8 home)
        (participant team-16 m8 away)
        (participant team-17 m9 home)
        (participant team-18 m9 away)
        (participant team-19 m10 home)
        (participant team-20 m10 away)
        (participant team-21 m11 home)
        (participant team-22 m11 away)
        (participant team-23 m12 home)
        (participant team-24 m12 away)
        (participant team-25 m13 home)
        (participant team-26 m13 away)
        (participant team-27 m14 home)
        (participant team-28 m14 away)
        (participant team-29 m15 home)
        (participant team-30 m15 away)
        (participant team-31 m16 home)
        (participant team-32 m16 away)
        (connected m1 m17 home)
        (connected m2 m17 away)
        (connected m3 m18 home)
        (connected m4 m18 away)
        (connected m5 m19 home)
        (connected m6 m19 away)
        (connected m7 m20 home)
        (connected m8 m20 away)
        (connected m9 m21 home)
        (connected m10 m21 away)
        (connected m11 m22 home)
        (connected m12 m22 away)
        (connected m13 m23 home)
        (connected m14 m23 away)
        (connected m15 m24 home)
        (connected m16 m24 away)
        (connected m17 m25 home)
        (connected m18 m25 away)
        (connected m19 m26 home)
        (connected m20 m26 away)
        (connected m21 m27 home)
        (connected m22 m27 away)
        (connected m23 m28 home)
        (connected m24 m28 away)
        (connected m25 m29 home)
        (connected m26 m29 away)
        (connected m27 m30 home)
        (connected m28 m30 away)
        (connected m29 m31 home)
        (connected m30 m31 away)
        (has-conflict m6)
        (has-conflict m7)
        (has-conflict m10)
        (has-conflict m16)
        (has-conflict m17)
        (has-conflict m18)
        (has-conflict m21)
        (has-conflict m22)
        (has-conflict m24)
        (has-conflict m26)
        (has-conflict m27)
        (has-conflict m28)
        (has-conflict m31)
    )
    (:goal
        (verified m31)
    )
)

; plan
1. (start-champ-select m16 server-32 team-31 team-32)
   deleted: (server-available server-32)
   added: (scheduled m16)
   goals met: 0 of 1
2. (start-champ-select m9 server-31 team-17 team-18)
   deleted: (server-available server-31)
   added: (scheduled m9)
   goals met: 0 of 1
3. (declare-noshow m9 team-17)
   added: (played m9) (result-reported m9) (winner m9 team-17) (verified m9) (winner-determined m9)
   goals met: 0 of 1
4. (declare-noshow m16 team-31)
   added: (played m16) (result-reported m16) (winner m16 team-31) (verified m16) (winner-determined m16)
   goals met: 0 of 1
5. (promote-to-next-round m16 m24 team-31 away)
   added: (participant team-31 m24 away)
   goals met: 0 of 1
6. (promote-to-next-round m9 m21 team-17 home)
   added: (participant team-17 m21 home)
   goals met: 0 of 1
7. (start-champ-select m1 server-30 team-1 team-2)
   deleted: (server-available server-30)
   added: (scheduled m1)
   goals met: 0 of 1
8. (declare-noshow m1 team-1)
   added: (played m1) (result-reported m1) (winner m1 team-1) (verified m1) (winner-determined m1)
   goals met: 0 of 1
9. (promote-to-next-round m1 m17 team-1 home)
   added: (participant team-1 m17 home)
   goals met: 0 of 1
10. (start-champ-select m15 server-29 team-29 team-30)
   deleted: (server-available server-29)
   added: (scheduled m15)
   goals met: 0 of 1
11. (declare-noshow m15 team-29)
   added: (played m15) (result-reported m15) (winner m15 team-29) (verified m15) (winner-determined m15)
   goals met: 0 of 1
12. (promote-to-next-round m15 m24 team-29 home)
   added: (participant team-29 m24 home)
   goals met: 0 of 1
13. (start-champ-select m24 server-28 team-29 team-31)
   deleted: (server-available server-28)
   added: (scheduled m24)
   goals met: 0 of 1
14. (declare-noshow m24 team-29)
   added: (played m24) (result-reported m24) (winner m24 team-29) (verified m24) (winner-determined m24)
   goals met: 0 of 1
15. (promote-to-next-round m24 m28 team-29 away)
   added: (participant team-29 m28 away)
   goals met: 0 of 1
16. (start-champ-select m14 server-27 team-27 team-28)
   deleted: (server-available server-27)
   added: (scheduled m14)
   goals met: 0 of 1
17. (declare-noshow m14 team-27)
   added: (played m14) (result-reported m14) (winner m14 team-27) (verified m14) (winner-determined m14)
   goals met: 0 of 1
18. (start-champ-select m13 server-26 team-25 team-26)
   deleted: (server-available server-26)
   added: (scheduled m13)
   goals met: 0 of 1
19. (declare-noshow m13 team-25)
   added: (played m13) (result-reported m13) (winner m13 team-25) (verified m13) (winner-determined m13)
   goals met: 0 of 1
20. (start-champ-select m11 server-25 team-21 team-22)
   deleted: (server-available server-25)
   added: (scheduled m11)
   goals met: 0 of 1
21. (declare-noshow m11 team-21)
   added: (played m11) (result-reported m11) (winner m11 team-21) (verified m11) (winner-determined m11)
   goals met: 0 of 1
22. (start-champ-select m10 server-24 team-19 team-20)
   deleted: (server-available server-24)
   added: (scheduled m10)
   goals met: 0 of 1
23. (declare-noshow m10 team-19)
   added: (played m10) (result-reported m10) (winner m10 team-19) (verified m10) (winner-determined m10)
   goals met: 0 of 1
24. (start-champ-select m8 server-23 team-15 team-16)
   deleted: (server-available server-23)
   added: (scheduled m8)
   goals met: 0 of 1
25. (declare-noshow m8 team-15)
   added: (played m8) (result-reported m8) (winner m8 team-15) (verified m8) (winner-determined m8)
   goals met: 0 of 1
26. (start-champ-select m7 server-22 team-13 team-14)
   deleted: (server-available server-22)
   added: (scheduled m7)
   goals met: 0 of 1
27. (declare-noshow m7 team-13)
   added: (played m7) (result-reported m7) (winner m7 team-13) (verified m7) (winner-determined m7)
   goals met: 0 of 1
28. (start-champ-select m6 server-21 team-11 team-12)
   deleted: (server-available server-21)
   added: (scheduled m6)
   goals met: 0 of 1
29. (declare-noshow m6 team-11)
   added: (played m6) (result-reported m6) (winner m6 team-11) (verified m6) (winner-determined m6)
   goals met: 0 of 1
30. (start-champ-select m5 server-20 team-9 team-10)
   deleted: (server-available server-20)
   added: (scheduled m5)
   goals met: 0 of 1
31. (declare-noshow m5 team-9)
   added: (played m5) (result-reported m5) (winner m5 team-9) (verified m5) (winner-determined m5)
   goals met: 0 of 1
32. (start-champ-select m4 server-19 team-7 team-8)
   deleted: (server-available server-19)
   added: (scheduled m4)
   goals met: 0 of 1
33. (declare-noshow m4 team-7)
   added: (played m4) (result-reported m4) (winner m4 team-7) (verified m4) (winner-determined m4)
   goals met: 0 of 1
34. (start-champ-select m3 server-18 team-5 team-6)
   deleted: (server-available server-18)
   added: (scheduled m3)
   goals met: 0 of 1
35. (declare-noshow m3 team-5)
   added: (played m3) (result-reported m3) (winner m3 team-5) (verified m3) (winner-determined m3)
   goals met: 0 of 1
36. (start-champ-select m2 server-17 team-3 team-4)
   deleted: (server-available server-17)
   added: (scheduled m2)
   goals met: 0 of 1
37. (declare-noshow m2 team-3)
   added: (played m2) (result-reported m2) (winner m2 team-3) (verified m2) (winner-determined m2)
   goals met: 0 of 1
38. (promote-to-next-round m11 m22 team-21 home)
   added: (participant team-21 m22 home)
   goals met: 0 of 1
39. (promote-to-next-round m2 m17 team-3 away)
   added: (participant team-3 m17 away)
   goals met: 0 of 1
40. (start-champ-select m17 server-16 team-1 team-3)
   deleted: (server-available server-16)
   added: (scheduled m17)
   goals met: 0 of 1
41. (declare-noshow m17 team-1)
   added: (played m17) (result-reported m17) (winner m17 team-1) (verified m17) (winner-determined m17)
   goals met: 0 of 1
42. (promote-to-next-round m10 m21 team-19 away)
   added: (participant team-19 m21 away)
   goals met: 0 of 1
43. (start-champ-select m21 server-15 team-17 team-19)
   deleted: (server-available server-15)
   added: (scheduled m21)
   goals met: 0 of 1
44. (declare-noshow m21 team-17)
   added: (played m21) (result-reported m21) (winner m21 team-17) (verified m21) (winner-determined m21)
   goals met: 0 of 1
45. (promote-to-next-round m14 m23 team-27 away)
   added: (participant team-27 m23 away)
   goals met: 0 of 1
46. (promote-to-next-round m8 m20 team-15 away)
   added: (participant team-15 m20 away)
   goals met: 0 of 1
47. (promote-to-next-round m21 m27 team-17 home)
   added: (participant team-17 m27 home)
   goals met: 0 of 1
48. (promote-to-next-round m17 m25 team-1 home)
   added: (participant team-1 m25 home)
   goals met: 0 of 1
49. (promote-to-next-round m3 m18 team-5 home)
   added: (participant team-5 m18 home)
   goals met: 0 of 1
50. (promote-to-next-round m4 m18 team-7 away)
   added: (participant team-7 m18 away)
   goals met: 0 of 1
51. (start-champ-select m18 server-14 team-5 team-7)
   deleted: (server-available server-14)
   added: (scheduled m18)
   goals met: 0 of 1
52. (declare-noshow m18 team-5)
   added: (played m18) (result-reported m18) (winner m18 team-5) (verified m18) (winner-determined m18)
   goals met: 0 of 1
53. (promote-to-next-round m18 m25 team-5 away)
   added: (participant team-5 m25 away)
   goals met: 0 of 1
54. (start-champ-select m25 server-13 team-1 team-5)
   deleted: (server-available server-13)
   added: (scheduled m25)
   goals met: 0 of 1
55. (declare-noshow m25 team-1)
   added: (played m25) (result-reported m25) (winner m25 team-1) (verified m25) (winner-determined m25)
   goals met: 0 of 1
56. (promote-to-next-round m25 m29 team-1 home)
   added: (participant team-1 m29 home)
   goals met: 0 of 1
57. (promote-to-next-round m5 m19 team-9 home)
   added: (participant team-9 m19 home)
   goals met: 0 of 1
58. (promote-to-next-round m6 m19 team-11 away)
   added: (participant team-11 m19 away)
   goals met: 0 of 1
59. (start-champ-select m19 server-12 team-9 team-11)
   deleted: (server-available server-12)
   added: (scheduled m19)
   goals met: 0 of 1
60. (declare-noshow m19 team-9)
   added: (played m19) (result-reported m19) (winner m19 team-9) (verified m19) (winner-determined m19)
   goals met: 0 of 1
61. (promote-to-next-round m19 m26 team-9 home)
   added: (participant team-9 m26 home)
   goals met: 0 of 1
62. (promote-to-next-round m7 m20 team-13 home)
   added: (participant team-13 m20 home)
   goals met: 0 of 1
63. (start-champ-select m20 server-11 team-13 team-15)
   deleted: (server-available server-11)
   added: (scheduled m20)
   goals met: 0 of 1
64. (declare-noshow m20 team-13)
   added: (played m20) (result-reported m20) (winner m20 team-13) (verified m20) (winner-determined m20)
   goals met: 0 of 1
65. (promote-to-next-round m20 m26 team-13 away)
   added: (participant team-13 m26 away)
   goals met: 0 of 1
66. (start-champ-select m26 server-10 team-9 team-13)
   deleted: (server-available server-10)
   added: (scheduled m26)
   goals met: 0 of 1
67. (declare-noshow m26 team-9)
   added: (played m26) (result-reported m26) (winner m26 team-9) (verified m26) (winner-determined m26)
   goals met: 0 of 1
68. (promote-to-next-round m26 m29 team-9 away)
   added: (participant team-9 m29 away)
   goals met: 0 of 1
69. (start-champ-select m29 server-9 team-1 team-9)
   deleted: (server-available server-9)
   added: (scheduled m29)
   goals met: 0 of 1
70. (declare-noshow m29 team-1)
   added: (played m29) (result-reported m29) (winner m29 team-1) (verified m29) (winner-determined m29)
   goals met: 0 of 1
71. (promote-to-next-round m29 m31 team-1 home)
   added: (participant team-1 m31 home)
   goals met: 0 of 1
72. (promote-to-next-round m13 m23 team-25 home)
   added: (participant team-25 m23 home)
   goals met: 0 of 1
73. (start-champ-select m23 server-8 team-25 team-27)
   deleted: (server-available server-8)
   added: (scheduled m23)
   goals met: 0 of 1
74. (declare-noshow m23 team-25)
   added: (played m23) (result-reported m23) (winner m23 team-25) (verified m23) (winner-determined m23)
   goals met: 0 of 1
75. (promote-to-next-round m23 m28 team-25 home)
   added: (participant team-25 m28 home)
   goals met: 0 of 1
76. (start-champ-select m28 server-7 team-25 team-29)
   deleted: (server-available server-7)
   added: (scheduled m28)
   goals met: 0 of 1
77. (declare-noshow m28 team-25)
   added: (played m28) (result-reported m28) (winner m28 team-25) (verified m28) (winner-determined m28)
   goals met: 0 of 1
78. (promote-to-next-round m28 m30 team-25 away)
   added: (participant team-25 m30 away)
   goals met: 0 of 1
79. (start-champ-select m12 server-6 team-23 team-24)
   deleted: (server-available server-6)
   added: (scheduled m12)
   goals met: 0 of 1
80. (declare-noshow m12 team-23)
   added: (played m12) (result-reported m12) (winner m12 team-23) (verified m12) (winner-determined m12)
   goals met: 0 of 1
81. (promote-to-next-round m12 m22 team-23 away)
   added: (participant team-23 m22 away)
   goals met: 0 of 1
82. (start-champ-select m22 server-5 team-21 team-23)
   deleted: (server-available server-5)
   added: (scheduled m22)
   goals met: 0 of 1
83. (declare-noshow m22 team-21)
   added: (played m22) (result-reported m22) (winner m22 team-21) (verified m22) (winner-determined m22)
   goals met: 0 of 1
84. (promote-to-next-round m22 m27 team-21 away)
   added: (participant team-21 m27 away)
   goals met: 0 of 1
85. (start-champ-select m27 server-3 team-17 team-21)
   deleted: (server-available server-3)
   added: (scheduled m27)
   goals met: 0 of 1
86. (declare-noshow m27 team-17)
   added: (played m27) (result-reported m27) (winner m27 team-17) (verified m27) (winner-determined m27)
   goals met: 0 of 1
87. (promote-to-next-round m27 m30 team-17 home)
   added: (participant team-17 m30 home)
   goals met: 0 of 1
88. (start-champ-select m30 server-4 team-17 team-25)
   deleted: (server-available server-4)
   added: (scheduled m30)
   goals met: 0 of 1
89. (declare-noshow m30 team-17)
   added: (played m30) (result-reported m30) (winner m30 team-17) (verified m30) (winner-determined m30)
   goals met: 0 of 1
90. (promote-to-next-round m30 m31 team-17 away)
   added: (participant team-17 m31 away)
   goals met: 0 of 1
91. (start-champ-select m31 server-1 team-1 team-17)
   deleted: (server-available server-1)
   added: (scheduled m31)
   goals met: 0 of 1
92. (declare-noshow m31 team-1)
   added: (played m31) (result-reported m31) (winner m31 team-1) (verified m31) (winner-determined m31)
   goals met: 1 of 1
